---
kind: method
id: M:Autodesk.Revit.DB.NumberSystem.GetReferencePick
source: html/8c6e215d-1783-4f3f-6b58-9efcb5e43cc8.htm
---
# Autodesk.Revit.DB.NumberSystem.GetReferencePick Method

Gets the reference curve.

## Syntax (C#)
```csharp
public Reference GetReferencePick()
```

## Returns
The pick of reference curve.